In [1]:
import pandas as pd

In [ ]:
datosagricolas = pd.read_csv('Agriculture.csv')
datosagricolas

In [4]:
type(datosagricolas)

pandas.core.frame.DataFrame

In [5]:
datosagricolas.head(2)

,NGA,Variable,Value From,Value To,Value Note,Date From,Date To,Unit,Explanation
0,Big Island Hawaii,Carbohydrate Source 1,sweet potato,NaN,NaN,750,1800,NaN,Sweet potato was the the dominant crop in the ...
1,Big Island Hawaii,Cropping System,swidden,NaN,NaN,750,1400,NaN,Shifting cultivation (in the form of swidden a...

In [6]:
datosagricolas.tail(2)

,NGA,Variable,Value From,Value To,Value Note,Date From,Date To,Unit,Explanation
328,Yemeni Coastal Plain,Irrigation,present,NaN,NaN,-1500,2001,NaN,According to Ethnographic Atlas variable 28 'I...
329,Yemeni Coastal Plain,Irrigation Coefficient,1.48,NaN,NaN,-1500,2000,NaN,CC estimate

In [7]:
pd.set_option('display.max_columns',None)

In [9]:
datosagricolas.nunique()

NGA             30
Variable         9
Value From      93
Value To        40
Value Note       4
Date From       94
Date To         88
Unit             1
Explanation    252
dtype: int64

In [ ]:
datos_cl

In [ ]:
datosagricolas.drop()

#df.drop(columnas_sn_info,axis=1,inplace=T) elimina del data frame original
df_clean = df.drop(columnas_sn_info, axis=1)